{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": false,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[BOS]": 5,
      "[EOS]": 6,
      "\"": 7,
      "(": 8,
      ")": 9,
      ",": 10,
      "-": 11,
      ":": 12,
      "=": 13,
      "A": 14,
      "B": 15,
      "E": 16,
      "F": 17,
      "I": 18,
      "L": 19,
      "M": 20,
      "N": 21,
      "P": 22,
      "R": 23,
      "S": 24,
      "T": 25,
      "W": 26,
      "^": 27,
      "a": 28,
      "d": 29,
      "e": 30,
      "f": 31,
      "h": 32,
      "i": 33,
      "k": 34,
      "l": 35,
      "m": 36,
      "n": 37,
      "o": 38,
      "p": 39,
      "q": 40,
      "r": 41,
      "s": 42,
      "t": 43,
      "v": 44,
      "x": 45,
      "y": 46,
      "z": 47,
      "、": 48,
      "。": 49,
      "一": 50,
      "上": 51,
      "下": 52,
      "个": 53,
      "丰": 54,
      "为": 55,
      "么": 56,
      "习": 57,
      "了": 58,
      "什": 59,
      "今": 60,
      "代": 61,
      "以": 62,
      "们": 63,
      "优": 64,
      "位": 65,
      "作": 66,
      "你": 67,
      "使": 68,
      "例": 69,
      "信": 70,
      "出": 71,
      "分": 72,
      "到": 73,
      "制": 74,
      "动": 75,
      "化": 76,
      "升": 77,
      "单": 78,
      "参": 79,
      "吗": 80,
      "器": 81,
      "在": 82,
      "型": 83,
      "复": 84,
      "够": 85,
      "大": 86,
      "天": 87,
      "好": 88,
      "始": 89,
      "子": 90,
      "学": 91,
      "富": 92,
      "将": 93,
      "小": 94,
      "布": 95,
      "常": 96,
      "建": 97,
      "开": 98,
      "式": 99,
      "强": 100,
      "归": 101,
      "律": 102,
      "心": 103,
      "息": 104,
      "我": 105,
      "手": 106,
      "捉": 107,
      "捕": 108,
      "据": 109,
      "推": 110,
      "提": 111,
      "搭": 112,
      "效": 113,
      "数": 114,
      "文": 115,
      "方": 116,
      "时": 117,
      "是": 118,
      "机": 119,
      "杂": 120,
      "来": 121,
      "核": 122,
      "概": 123,
      "模": 124,
      "欢": 125,
      "率": 126,
      "现": 127,
      "理": 128,
      "用": 129,
      "的": 130,
      "知": 131,
      "码": 132,
      "示": 133,
      "种": 134,
      "简": 135,
      "类": 136,
      "练": 137,
      "统": 138,
      "编": 139,
      "置": 140,
      "能": 141,
      "表": 142,
      "规": 143,
      "解": 144,
      "言": 145,
      "计": 146,
      "训": 147,
      "词": 148,
      "语": 149,
      "请": 150,
      "越": 151,
      "轻": 152,
      "输": 153,
      "达": 154,
      "迎": 155,
      "通": 156,
      "道": 157,
      "释": 158,
      "量": 159,
      "，": 160,
      "：": 161,
      "？": 162,
      "##k": 163,
      "##L": 164,
      "##a": 165,
      "##M": 166,
      "##A": 167,
      "##l": 168,
      "##s": 169,
      "##h": 170,
      "##t": 171,
      "##e": 172,
      "##n": 173,
      "##i": 174,
      "##o": 175,
      "##I": 176,
      "##S": 177,
      "##N": 178,
      "##r": 179,
      "##m": 180,
      "##z": 181,
      "##f": 182,
      "##x": 183,
      "##d": 184,
      "##W": 185,
      "##y": 186,
      "##P": 187,
      "##E": 188,
      "##en": 189,
      "##on": 190,
      "##tt": 191,
      "##ti": 192,
      "##enti": 193,
      "##ttenti": 194,
      "##ttention": 195,
      "LL": 196,
      "##er": 197,
      "##or": 198,
      "##orm": 199,
      "##aM": 200,
      "LLaM": 201,
      "LLaMA": 202,
      "to": 203,
      "##ken": 204,
      "token": 205,
      "##el": 206,
      "Tr": 207,
      "##an": 208,
      "##sf": 209,
      "##ormer": 210,
      "Tran": 211,
      "##sformer": 212,
      "Transformer": 213,
      "Ad": 214,
      "##am": 215,
      "Adam": 216,
      "AdamW": 217,
      "Py": 218,
      "attention": 219,
      "qk": 220,
      "so": 221,
      "##ax": 222,
      "##hon": 223,
      "##tm": 224,
      "##thon": 225,
      "##ftm": 226,
      "Python": 227,
      "softm": 228,
      "softmax": 229,
      "AI": 230,
      "Fl": 231,
      "##as": 232,
      "##Attention": 233,
      "##hAttention": 234,
      "Flas": 235,
      "FlashAttention": 236,
      "BP": 237,
      "##iz": 238,
      "LLM": 239,
      "tokeniz": 240,
      "BPE": 241,
      "tokenizer": 242,
      "Attention": 243,
      "RM": 244,
      "Sel": 245,
      "##SN": 246,
      "RMSN": 247,
      "Self": 248,
      "RMSNorm": 249,
      "de": 250,
      "hel": 251,
      "pr": 252,
      "##lo": 253,
      "##nt": 254,
      "##int": 255,
      "def": 256,
      "hello": 257,
      "print": 258
    }
  }
}